zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_EIM.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_EIM.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_EIM
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_EIM_H_)  /* Check if memory map has not been already included */
#define S32K566_EIM_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- EIM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EIM_Peripheral_Access_Layer EIM Peripheral Access Layer
 * @{
 */

/** EIM - Register Layout Typedef */
typedef struct EIM_Struct {
  __IO uint32_t EIMCR;                             /**< Error Injection Module Configuration Register, offset: 0x0 */
  __IO uint32_t EICHEN;                            /**< Error Injection Channel Enable register, offset: 0x4 */
  uint8_t RESERVED_0[248];
  __IO uint32_t EICHD0_WORD0;                      /**< Error Injection Channel Descriptor 0, Word0, offset: 0x100, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD0_WORD1;                      /**< Error Injection Channel Descriptor 0, Word1, offset: 0x104 */
  __IO uint32_t EICHD0_WORD2;                      /**< Error Injection Channel Descriptor 0, Word2, offset: 0x108, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  uint8_t RESERVED_1[52];
  __IO uint32_t EICHD1_WORD0;                      /**< Error Injection Channel Descriptor 1, Word0, offset: 0x140, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD1_WORD1;                      /**< Error Injection Channel Descriptor 1, Word1, offset: 0x144 */
  __IO uint32_t EICHD1_WORD2;                      /**< Error Injection Channel Descriptor 1, Word2, offset: 0x148, available only on: EIM_2, EIM_3 (missing on CPE_EIM, EIM_0, LPE_EIM) */
  __IO uint32_t EICHD1_WORD3;                      /**< Error Injection Channel Descriptor 1, Word3, offset: 0x14C, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD1_WORD4;                      /**< Error Injection Channel Descriptor 1, Word4, offset: 0x150, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_2[44];
  __IO uint32_t EICHD2_WORD0;                      /**< Error Injection Channel Descriptor 2, Word0, offset: 0x180, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD2_WORD1;                      /**< Error Injection Channel Descriptor 2, Word1, offset: 0x184 */
  __IO uint32_t EICHD2_WORD2;                      /**< Error Injection Channel Descriptor 2, Word2, offset: 0x188, available only on: EIM_2, EIM_3, LPE_EIM (missing on CPE_EIM, EIM_0) */
  __IO uint32_t EICHD2_WORD3;                      /**< Error Injection Channel Descriptor 2, Word3, offset: 0x18C, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD2_WORD4;                      /**< Error Injection Channel Descriptor 2, Word4, offset: 0x190, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_3[44];
  __IO uint32_t EICHD3_WORD0;                      /**< Error Injection Channel Descriptor 3, Word0, offset: 0x1C0, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD3_WORD1;                      /**< Error Injection Channel Descriptor 3, Word1, offset: 0x1C4 */
  __IO uint32_t EICHD3_WORD2;                      /**< Error Injection Channel Descriptor 3, Word2, offset: 0x1C8, available only on: EIM_0, EIM_2, EIM_3, LPE_EIM (missing on CPE_EIM) */
  __IO uint32_t EICHD3_WORD3;                      /**< Error Injection Channel Descriptor 3, Word3, offset: 0x1CC, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD3_WORD4;                      /**< Error Injection Channel Descriptor 3, Word4, offset: 0x1D0, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_4[44];
  __IO uint32_t EICHD4_WORD0;                      /**< Error Injection Channel Descriptor 4, Word0, offset: 0x200, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD4_WORD1;                      /**< Error Injection Channel Descriptor 4, Word1, offset: 0x204 */
  __IO uint32_t EICHD4_WORD2;                      /**< Error Injection Channel Descriptor 4, Word2, offset: 0x208, available only on: EIM_2, EIM_3, LPE_EIM (missing on CPE_EIM, EIM_0) */
  __IO uint32_t EICHD4_WORD3;                      /**< Error Injection Channel Descriptor 4, Word3, offset: 0x20C, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD4_WORD4;                      /**< Error Injection Channel Descriptor 4, Word4, offset: 0x210, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD4_WORD5;                      /**< Error Injection Channel Descriptor 4, Word5, offset: 0x214, available only on: LPE_EIM (missing on CPE_EIM, EIM_0, EIM_2, EIM_3) */
  __IO uint32_t EICHD4_WORD6;                      /**< Error Injection Channel Descriptor 4, Word6, offset: 0x218, available only on: LPE_EIM (missing on CPE_EIM, EIM_0, EIM_2, EIM_3) */
  uint8_t RESERVED_5[36];
  __IO uint32_t EICHD5_WORD0;                      /**< Error Injection Channel Descriptor 5, Word0, offset: 0x240, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD5_WORD1;                      /**< Error Injection Channel Descriptor 5, Word1, offset: 0x244 */
  __IO uint32_t EICHD5_WORD2;                      /**< Error Injection Channel Descriptor 5, Word2, offset: 0x248, available only on: EIM_2, EIM_3 (missing on CPE_EIM, EIM_0, LPE_EIM) */
  uint8_t RESERVED_6[52];
  __IO uint32_t EICHD6_WORD0;                      /**< Error Injection Channel Descriptor 6, Word0, offset: 0x280, available only on: EIM_2, LPE_EIM (missing on CPE_EIM, EIM_0, EIM_3) */
  __IO uint32_t EICHD6_WORD1;                      /**< Error Injection Channel Descriptor 6, Word1, offset: 0x284 */
  __IO uint32_t EICHD6_WORD2;                      /**< Error Injection Channel Descriptor 6, Word2, offset: 0x288, available only on: EIM_2, EIM_3, LPE_EIM (missing on CPE_EIM, EIM_0) */
  __IO uint32_t EICHD6_WORD3;                      /**< Error Injection Channel Descriptor 6, Word3, offset: 0x28C, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD6_WORD4;                      /**< Error Injection Channel Descriptor 6, Word4, offset: 0x290, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_7[44];
  __IO uint32_t EICHD7_WORD0;                      /**< Error Injection Channel Descriptor 7, Word0, offset: 0x2C0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD7_WORD1;                      /**< Error Injection Channel Descriptor 7, Word1, offset: 0x2C4, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD7_WORD2;                      /**< Error Injection Channel Descriptor 7, Word2, offset: 0x2C8, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD7_WORD3;                      /**< Error Injection Channel Descriptor 7, Word3, offset: 0x2CC, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD7_WORD4;                      /**< Error Injection Channel Descriptor 7, Word4, offset: 0x2D0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_8[44];
  __IO uint32_t EICHD8_WORD0;                      /**< Error Injection Channel Descriptor 8, Word0, offset: 0x300, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD8_WORD1;                      /**< Error Injection Channel Descriptor 8, Word1, offset: 0x304, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD8_WORD2;                      /**< Error Injection Channel Descriptor 8, Word2, offset: 0x308, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD8_WORD3;                      /**< Error Injection Channel Descriptor 8, Word3, offset: 0x30C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD8_WORD4;                      /**< Error Injection Channel Descriptor 8, Word4, offset: 0x310, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD8_WORD5;                      /**< Error Injection Channel Descriptor 8, Word5, offset: 0x314, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_9[40];
  __IO uint32_t EICHD9_WORD0;                      /**< Error Injection Channel Descriptor 9, Word0, offset: 0x340, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD9_WORD1;                      /**< Error Injection Channel Descriptor 9, Word1, offset: 0x344, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD9_WORD2;                      /**< Error Injection Channel Descriptor 9, Word2, offset: 0x348, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD9_WORD3;                      /**< Error Injection Channel Descriptor 9, Word3, offset: 0x34C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD9_WORD4;                      /**< Error Injection Channel Descriptor 9, Word4, offset: 0x350, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD9_WORD5;                      /**< Error Injection Channel Descriptor 9, Word5, offset: 0x354, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_10[40];
  __IO uint32_t EICHD10_WORD0;                     /**< Error Injection Channel Descriptor 10, Word0, offset: 0x380, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD10_WORD1;                     /**< Error Injection Channel Descriptor 10, Word1, offset: 0x384, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD10_WORD2;                     /**< Error Injection Channel Descriptor 10, Word2, offset: 0x388, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD10_WORD3;                     /**< Error Injection Channel Descriptor 10, Word3, offset: 0x38C, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD10_WORD4;                     /**< Error Injection Channel Descriptor 10, Word4, offset: 0x390, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD10_WORD5;                     /**< Error Injection Channel Descriptor 10, Word5, offset: 0x394, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_11[40];
  __IO uint32_t EICHD11_WORD0;                     /**< Error Injection Channel Descriptor 11, Word0, offset: 0x3C0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD11_WORD1;                     /**< Error Injection Channel Descriptor 11, Word1, offset: 0x3C4, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD11_WORD2;                     /**< Error Injection Channel Descriptor 11, Word2, offset: 0x3C8, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD11_WORD3;                     /**< Error Injection Channel Descriptor 11, Word3, offset: 0x3CC, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD11_WORD4;                     /**< Error Injection Channel Descriptor 11, Word4, offset: 0x3D0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD11_WORD5;                     /**< Error Injection Channel Descriptor 11, Word5, offset: 0x3D4, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_12[40];
  __IO uint32_t EICHD12_WORD0;                     /**< Error Injection Channel Descriptor 12, Word0, offset: 0x400, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD12_WORD1;                     /**< Error Injection Channel Descriptor 12, Word1, offset: 0x404, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD12_WORD2;                     /**< Error Injection Channel Descriptor 12, Word2, offset: 0x408, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD12_WORD3;                     /**< Error Injection Channel Descriptor 12, Word3, offset: 0x40C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD12_WORD4;                     /**< Error Injection Channel Descriptor 12, Word4, offset: 0x410, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_13[44];
  __IO uint32_t EICHD13_WORD0;                     /**< Error Injection Channel Descriptor 13, Word0, offset: 0x440, available only on: CPE_EIM, EIM_0, EIM_2 (missing on EIM_3, LPE_EIM) */
  __IO uint32_t EICHD13_WORD1;                     /**< Error Injection Channel Descriptor 13, Word1, offset: 0x444, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD13_WORD2;                     /**< Error Injection Channel Descriptor 13, Word2, offset: 0x448, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD13_WORD3;                     /**< Error Injection Channel Descriptor 13, Word3, offset: 0x44C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD13_WORD4;                     /**< Error Injection Channel Descriptor 13, Word4, offset: 0x450, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_14[44];
  __IO uint32_t EICHD14_WORD0;                     /**< Error Injection Channel Descriptor 14, Word0, offset: 0x480, available only on: CPE_EIM, EIM_0, EIM_2 (missing on EIM_3, LPE_EIM) */
  __IO uint32_t EICHD14_WORD1;                     /**< Error Injection Channel Descriptor 14, Word1, offset: 0x484, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD14_WORD2;                     /**< Error Injection Channel Descriptor 14, Word2, offset: 0x488, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD14_WORD3;                     /**< Error Injection Channel Descriptor 14, Word3, offset: 0x48C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD14_WORD4;                     /**< Error Injection Channel Descriptor 14, Word4, offset: 0x490, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_15[44];
  __IO uint32_t EICHD15_WORD0;                     /**< Error Injection Channel Descriptor 15, Word0, offset: 0x4C0, available only on: CPE_EIM, EIM_0, EIM_2 (missing on EIM_3, LPE_EIM) */
  __IO uint32_t EICHD15_WORD1;                     /**< Error Injection Channel Descriptor 15, Word1, offset: 0x4C4, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD15_WORD2;                     /**< Error Injection Channel Descriptor 15, Word2, offset: 0x4C8, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD15_WORD3;                     /**< Error Injection Channel Descriptor 15, Word3, offset: 0x4CC, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_16[48];
  __IO uint32_t EICHD16_WORD0;                     /**< Error Injection Channel Descriptor 16, Word0, offset: 0x500, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD16_WORD1;                     /**< Error Injection Channel Descriptor 16, Word1, offset: 0x504, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD16_WORD2;                     /**< Error Injection Channel Descriptor 16, Word2, offset: 0x508, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD16_WORD3;                     /**< Error Injection Channel Descriptor 16, Word3, offset: 0x50C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD16_WORD4;                     /**< Error Injection Channel Descriptor 16, Word4, offset: 0x510, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD16_WORD5;                     /**< Error Injection Channel Descriptor 16, Word5, offset: 0x514, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_17[40];
  __IO uint32_t EICHD17_WORD0;                     /**< Error Injection Channel Descriptor 17, Word0, offset: 0x540, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD17_WORD1;                     /**< Error Injection Channel Descriptor 17, Word1, offset: 0x544, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD17_WORD2;                     /**< Error Injection Channel Descriptor 17, Word2, offset: 0x548, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD17_WORD3;                     /**< Error Injection Channel Descriptor 17, Word3, offset: 0x54C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD17_WORD4;                     /**< Error Injection Channel Descriptor 17, Word4, offset: 0x550, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD17_WORD5;                     /**< Error Injection Channel Descriptor 17, Word5, offset: 0x554, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_18[40];
  __IO uint32_t EICHD18_WORD0;                     /**< Error Injection Channel Descriptor 18, Word0, offset: 0x580, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD18_WORD1;                     /**< Error Injection Channel Descriptor 18, Word1, offset: 0x584, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD18_WORD2;                     /**< Error Injection Channel Descriptor 18, Word2, offset: 0x588, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD18_WORD3;                     /**< Error Injection Channel Descriptor 18, Word3, offset: 0x58C, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD18_WORD4;                     /**< Error Injection Channel Descriptor 18, Word4, offset: 0x590, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD18_WORD5;                     /**< Error Injection Channel Descriptor 18, Word5, offset: 0x594, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_19[40];
  __IO uint32_t EICHD19_WORD0;                     /**< Error Injection Channel Descriptor 19, Word0, offset: 0x5C0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD19_WORD1;                     /**< Error Injection Channel Descriptor 19, Word1, offset: 0x5C4, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD19_WORD2;                     /**< Error Injection Channel Descriptor 19, Word2, offset: 0x5C8, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD19_WORD3;                     /**< Error Injection Channel Descriptor 19, Word3, offset: 0x5CC, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD19_WORD4;                     /**< Error Injection Channel Descriptor 19, Word4, offset: 0x5D0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD19_WORD5;                     /**< Error Injection Channel Descriptor 19, Word5, offset: 0x5D4, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_20[40];
  __IO uint32_t EICHD20_WORD0;                     /**< Error Injection Channel Descriptor 20, Word0, offset: 0x600, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD20_WORD1;                     /**< Error Injection Channel Descriptor 20, Word1, offset: 0x604, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD20_WORD2;                     /**< Error Injection Channel Descriptor 20, Word2, offset: 0x608, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD20_WORD3;                     /**< Error Injection Channel Descriptor 20, Word3, offset: 0x60C, available only on: CPE_EIM, EIM_0 (missing on EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD20_WORD4;                     /**< Error Injection Channel Descriptor 20, Word4, offset: 0x610, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD20_WORD5;                     /**< Error Injection Channel Descriptor 20, Word5, offset: 0x614, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_21[40];
  __IO uint32_t EICHD21_WORD0;                     /**< Error Injection Channel Descriptor 21, Word0, offset: 0x640, available only on: CPE_EIM, EIM_0, EIM_2 (missing on EIM_3, LPE_EIM) */
  __IO uint32_t EICHD21_WORD1;                     /**< Error Injection Channel Descriptor 21, Word1, offset: 0x644, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
