zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_EIM.h
  __IO uint32_t EICHD21_WORD2;                     /**< Error Injection Channel Descriptor 21, Word2, offset: 0x648, available only on: CPE_EIM, EIM_0, EIM_3 (missing on EIM_2, LPE_EIM) */
  __IO uint32_t EICHD21_WORD3;                     /**< Error Injection Channel Descriptor 21, Word3, offset: 0x64C, available only on: CPE_EIM, EIM_0 (missing on EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD21_WORD4;                     /**< Error Injection Channel Descriptor 21, Word4, offset: 0x650, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD21_WORD5;                     /**< Error Injection Channel Descriptor 21, Word5, offset: 0x654, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_22[40];
  __IO uint32_t EICHD22_WORD0;                     /**< Error Injection Channel Descriptor 22, Word0, offset: 0x680, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD22_WORD1;                     /**< Error Injection Channel Descriptor 22, Word1, offset: 0x684, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD22_WORD2;                     /**< Error Injection Channel Descriptor 22, Word2, offset: 0x688, available only on: CPE_EIM, EIM_0, EIM_3 (missing on EIM_2, LPE_EIM) */
  __IO uint32_t EICHD22_WORD3;                     /**< Error Injection Channel Descriptor 22, Word3, offset: 0x68C, available only on: CPE_EIM, EIM_0 (missing on EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD22_WORD4;                     /**< Error Injection Channel Descriptor 22, Word4, offset: 0x690, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD22_WORD5;                     /**< Error Injection Channel Descriptor 22, Word5, offset: 0x694, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_23[40];
  __IO uint32_t EICHD23_WORD0;                     /**< Error Injection Channel Descriptor 23, Word0, offset: 0x6C0, available only on: CPE_EIM, EIM_0, EIM_2 (missing on EIM_3, LPE_EIM) */
  __IO uint32_t EICHD23_WORD1;                     /**< Error Injection Channel Descriptor 23, Word1, offset: 0x6C4, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD23_WORD2;                     /**< Error Injection Channel Descriptor 23, Word2, offset: 0x6C8, available only on: CPE_EIM, EIM_0, EIM_2, EIM_3 (missing on LPE_EIM) */
  __IO uint32_t EICHD23_WORD3;                     /**< Error Injection Channel Descriptor 23, Word3, offset: 0x6CC, available only on: CPE_EIM, EIM_0 (missing on EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD23_WORD4;                     /**< Error Injection Channel Descriptor 23, Word4, offset: 0x6D0, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD23_WORD5;                     /**< Error Injection Channel Descriptor 23, Word5, offset: 0x6D4, available only on: EIM_0 (missing on CPE_EIM, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_24[40];
  __IO uint32_t EICHD24_WORD0;                     /**< Error Injection Channel Descriptor 24, Word0, offset: 0x700, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD24_WORD1;                     /**< Error Injection Channel Descriptor 24, Word1, offset: 0x704, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD24_WORD2;                     /**< Error Injection Channel Descriptor 24, Word2, offset: 0x708, available only on: CPE_EIM, EIM_3 (missing on EIM_0, EIM_2, LPE_EIM) */
  __IO uint32_t EICHD24_WORD3;                     /**< Error Injection Channel Descriptor 24, Word3, offset: 0x70C, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_25[48];
  __IO uint32_t EICHD25_WORD0;                     /**< Error Injection Channel Descriptor 25, Word0, offset: 0x740, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD25_WORD1;                     /**< Error Injection Channel Descriptor 25, Word1, offset: 0x744, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD25_WORD2;                     /**< Error Injection Channel Descriptor 25, Word2, offset: 0x748, available only on: CPE_EIM, EIM_3 (missing on EIM_0, EIM_2, LPE_EIM) */
  __IO uint32_t EICHD25_WORD3;                     /**< Error Injection Channel Descriptor 25, Word3, offset: 0x74C, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_26[48];
  __IO uint32_t EICHD26_WORD0;                     /**< Error Injection Channel Descriptor 26, Word0, offset: 0x780, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD26_WORD1;                     /**< Error Injection Channel Descriptor 26, Word1, offset: 0x784, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD26_WORD2;                     /**< Error Injection Channel Descriptor 26, Word2, offset: 0x788, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD26_WORD3;                     /**< Error Injection Channel Descriptor 26, Word3, offset: 0x78C, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_27[48];
  __IO uint32_t EICHD27_WORD0;                     /**< Error Injection Channel Descriptor 27, Word0, offset: 0x7C0, available only on: CPE_EIM, EIM_2 (missing on EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD27_WORD1;                     /**< Error Injection Channel Descriptor 27, Word1, offset: 0x7C4, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  __IO uint32_t EICHD27_WORD2;                     /**< Error Injection Channel Descriptor 27, Word2, offset: 0x7C8, available only on: CPE_EIM, EIM_3 (missing on EIM_0, EIM_2, LPE_EIM) */
  __IO uint32_t EICHD27_WORD3;                     /**< Error Injection Channel Descriptor 27, Word3, offset: 0x7CC, available only on: CPE_EIM (missing on EIM_0, EIM_2, EIM_3, LPE_EIM) */
  uint8_t RESERVED_28[48];
  __IO uint32_t EICHD28_WORD0;                     /**< Error Injection Channel Descriptor 28, Word0, offset: 0x800, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD28_WORD1;                     /**< Error Injection Channel Descriptor 28, Word1, offset: 0x804, available only on: CPE_EIM, EIM_2, EIM_3 (missing on EIM_0, LPE_EIM) */
  uint8_t RESERVED_29[56];
  __IO uint32_t EICHD29_WORD0;                     /**< Error Injection Channel Descriptor 29, Word0, offset: 0x840, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD29_WORD1;                     /**< Error Injection Channel Descriptor 29, Word1, offset: 0x844, available only on: EIM_2, EIM_3 (missing on CPE_EIM, EIM_0, LPE_EIM) */
  __IO uint32_t EICHD29_WORD2;                     /**< Error Injection Channel Descriptor 29, Word2, offset: 0x848, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  uint8_t RESERVED_30[52];
  __IO uint32_t EICHD30_WORD0;                     /**< Error Injection Channel Descriptor 30, Word0, offset: 0x880, available only on: EIM_2 (missing on CPE_EIM, EIM_0, EIM_3, LPE_EIM) */
  __IO uint32_t EICHD30_WORD1;                     /**< Error Injection Channel Descriptor 30, Word1, offset: 0x884, available only on: EIM_2, EIM_3 (missing on CPE_EIM, EIM_0, LPE_EIM) */
  uint8_t RESERVED_31[56];
  __IO uint32_t EICHD31_WORD0;                     /**< Error Injection Channel Descriptor 31, Word0, offset: 0x8C0, available only on: EIM_2, EIM_3 (missing on CPE_EIM, EIM_0, LPE_EIM) */
  __IO uint32_t EICHD31_WORD1;                     /**< Error Injection Channel Descriptor 31, Word1, offset: 0x8C4, available only on: EIM_2, EIM_3 (missing on CPE_EIM, EIM_0, LPE_EIM) */
  __IO uint32_t EICHD31_WORD2;                     /**< Error Injection Channel Descriptor 31, Word2, offset: 0x8C8, available only on: EIM_3 (missing on CPE_EIM, EIM_0, EIM_2, LPE_EIM) */
} EIM_Type, *EIM_MemMapPtr;

/** Number of instances of the EIM module. */
#define EIM_INSTANCE_COUNT                       (5u)

